import 'package:charity_app/localization/demo_localizations.dart';
import 'package:charity_app/localization/language_constants.dart';
import 'package:charity_app/utils/device_size_config.dart';
import 'package:charity_app/view/theme/themes.dart';
import 'package:charity_app/view/widgets/app_bar_auth.dart';
import 'package:flutter/cupertino.dart';
import 'package:charity_app/utils/utils.dart';
import 'package:flutter/material.dart';

class AboutUseScreen extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: AppThemeStyle.primaryColor,
      appBar: widgetAppBarTitle(context),
      body: Column(
        children: <Widget>[
          Text(
            getTranslated(context, 'about_us'),
            style: TextStyle(
                fontSize: 24.0,
                letterSpacing: 0.4,
                fontWeight: FontWeight.bold,
                color: Colors.white),
          ),
          SizedBox(
            height: SizeConfig.calculateBlockVertical(30),
            width: double.infinity,
          ),
          Expanded(
            child: ClipRRect(
              borderRadius: const BorderRadius.only(
                  topLeft: const Radius.circular(40),
                  topRight: const Radius.circular(40)),
              child: Container(
                width: double.infinity,
                color: Color.fromRGBO(244, 244, 244, 1),
                child: Padding(
                  padding: const EdgeInsets.all(20),
                  child: Align(
                    alignment: Alignment.topCenter,
                    child: SingleChildScrollView(
                      child: Text(DemoLocalization.of(context).locale.countryCode == 'UZ'
                          ?
'''
  Біз – Назарбаев Университеті Жоғары білім беру мектебінің түлектерінен тұратын бастама тобы дамуында ерекшелігі бар балалардың ата-аналары мен қамқоршыларына көмек көрсету мақсатында инклюзивті білім аясындағы зерттеушілерді, педагогикалық және медициналық коррекция сарапшылары мен ерте бастан араласатын барлық мамандарды біріктірді. 

  Біз дамуында ерекшелігі бар балалардың ата-аналары мен қамқоршыларына:

  - ерте бастан араласатын мамандардан сенімді ақпарат алуға, 

  - үйретуге арналған видеолар көмегімен балаларды үй жағдайында өзбетімен оқытуға, 
  
  - форум арқылы бірдей пікірдегі адамдарды табуға, 
  
  - қол жетімді тілде халықаралық зерттеулермен (орыс және қазақ тіліндегі шолулармен) танысуға мүмкіндік алуға,  
  
  - біздің деректер базамыздан қорлардың, оңалту орталықтардың, психологиялық-педагогикалық коррекция кабинеттердің, психо-медициналық және педагогикалық кеңес беру орталықтарының байланыстарын алуға,
  
  - инклюзия әлемінен ақпараттар алуға,
  
  - мақалалар мен видеолар көмегі арқылы Qbala  жобасының заңгерлер тобымен бірге ерекше қажеттілігі бар балалардың ата-ана құқықтары жайлы үйренуге, 
  
  - ата-аналардың өзекті мәселелерін тиісті атқарушы органдарға жеткізуге көмек көрсетеміз.

  Біз бейінді мамандарға: 

  - өзінің практикалық тәжірибесімен бөлісу үшін платформа алаңына кіруге қол жеткізуге,
  
  - басқа мамандардың тәжірибесін игеруге,

  - бірдей пікірдегі адамдармен байланыс орнатуға,
  
  - ата-аналардан кері байланыс алуға,

  - ҚР мен ТМД аумағында өзінің танымдық материалдарын таратуға, 
  
  - халықаралық әдебиетттергі қол жеткізуге,

  - инклюзия тақырыбы бойынша вебинарлар мен шеберлік сыныптарына қатысуға көмек көрсететміз.
'''
                          :
                        '''
  Мы - инициативная группа выпускников Высшей Школы Образования Назарбаев Университета, объединили исследователей в области инклюзии, экспертов в педагогической и медицинской коррекции, редакторов, и всех специалистов по раннему вмешательству для помощи родителям и опекунам детей с особенностями развития.
 
  Мы помогаем родителям и опекунам детей с особенностями развития:

  - получать достоверную информацию от специалистов по раннему вмешательству, 
  
  - самостоятельно обучать детей в домашних условиях с помощью обучающих видео, 
  
  - находить единомышленников через форум, 
  
  - получать доступ к международным исследованиям на доступном языке (обзоры на русском и казахском языках)
  
  - получить контакты фондов, реабилитационных центров, КППК, ПМПК, инклюзивных детских садов в нашей базе данных,
  
  - получать новости из мира инклюзии,
  
  - изучить права родителей детей с особыми потребностями совместно с группой юристов проекта Qbala через статьи и видео, 
  
  - донести актуальные проблемы родителей до соответствующих исполнительных органов.
  
  Мы помогаем профильным специалистам: 
  
  - получить доступ к площадке для размещения своего практического опыта,
  
  - изучать опыт других специалистов,
  
  - наладить коммуникацию среди единомышленников,
  
  - получить обратную связь от родителей,
  
  - распространить свой обучающий материал на территории РК и СНГ,
  
  - получить доступ к международной литературе,
  
  - участвовать в вебинарах, мастер-классах по теме инклюзии.

                        ''',
                        style: AppThemeStyle.appBarStyle16.copyWith(fontWeight: FontWeight.normal),
                      ),
                    ),
                  ),
                ),
              ),
            ),
          ),
          //  mainUI(model),
        ],
      ),
    );
  }
}
